### Процедуры и функции
### процедура define:
# def Error():
#     print("Ошибка программы")
#
# n = int (input())
# if n < 0:
#     Error()

#У процедуры нет возврата, в отличии от функции. Она не выдает число или букву и т.д. Часто у нее нет аргументов от которой она зависит
# Процедура - вспомогательный алгоритм, который выполняет некоторые действия. Не возвращает ничего.
#Прописывается над основной программой. В программе может быть много процедур. Ее необходимо вызвать.


# # #Задача процедура с параметром. Вывести на экран записаь целого числа (0...255) в 8 битном двоичном коде
# def printBin(n):
#     n = int(input())
#     k = 128
#     while k > 0:
#         print(n//k,
#               end = "")
#         n = n % k
#         k = k // 2
#
# printBin(99)
#
# #99 в данном случае аргумент (значения параметра)
#
# # Параметр для это процедуры число n
# # Параметры - данные, изменяющие работы процедуры.

# ==========================================================

#Локальньные и глобальные переменные

# a = 5 #- глобальная переменная
# def qq():
#     a = 1
#     print(a)
# qq()
# print(a)

# def qq1():
#     global a
#     a = 1
# qq1()
# print(a)

# global делает переменную глобальной


# 1) процедура связано с глобальными переменными
# 2) печатет только сумму x и y нельзя напечатать сумму других переменных или сумму
#
# def Sum2 (a,b):
#     print(a+b)
#
# x = 5; y = 10
#
# Sum2(x, y)

#аргумент не обязательно должны называться как в функции

# ===============================================================
# num = int(input())
# def line(n):
#     for _ in range(n):
#         print("-", end = "")
# line(num)

# def printRim (n):
#     for i, ii in [("M", 1000), ("D", 500), ("C", 100), ("L", 50),
#                   ("X", 10), ("V", 5), ("I", 1)]:
#         print((n//ii)*i, end="")
#         n = n % ii
#     print()
#
# printRim(int(input()))
#
# n = int(input())

#===============================================

#ФУНКЦИЯ - вспомогательный алгоритм, который возвращает значение-результат
#В питоне нет процедур, есть только процедуры в виде функции

#Написать функцию которая вычисляет сумму цифр числа:

# def sumDigits (n):
#     sum = 0
#     while n != 0:
#         sum += n % 10
#         n = n//10
#     return sum
#
# print(sumDigits(12345))

#можем возвращать несколько значения
# def divmod (x,y):
#     d = x//y
#     m = x%y
#     return d, m
#
# a, b = divmod(7, 3)
# print(a, b) # 2 1 - не кортеж
#
# q =divmod(7,3 )
# print(q) # (2,1) - кортеж

#найти все простые числа в диапазоне от 2 до 1000:

# def isPrime(n):
#     k = 2
#     while k*k <= n and n % k != 0:
#         k += 1
#     return (k*k > n)
#
# n = int(input())
# print(isPrime(n))


#======================================================

# def nod(a, b):
#     while a != 0 and b != 0:
#         if a > b:
#             a = a % b
#         else:
#             b = b % a
#     return(a+b)
# print(nod(7006652, 112307574))

# def sumNum(n):
#     sum = 0
#     for i in range(len(str(n))):
#         sum += n % 10
#         n //= 10
#     return(sum)
# print(sumNum(123))


#совершенное число = сумма всех своих делителей равно самому числу

#напишите функцию сокращения дробей

# def gcd (a,b):
#     while a != 0 and b != 0:
#         if a > b:
#             a = a % b
#         else:
#             b = b % a
#     return (a+b)
#
# a, b = map(int, input().split())
# x = gcd(a,b)
# print(int(a/x), int(b/x))


#=================================================================
# def f(x):
#     r = bin(x)[2:]
#     if x % 2 == 0:
#         r = '11' + r
#     else:
#         r = '1' + r + '10'
#     return int(r, 2)
#
# m = 0
# for n in range(567891235, 567801235, -1):
#     m = max(m, f(n))
#
# print(m)

# def f(n):
#     copy = n
#     x = ''
#     while copy > 0:
#         x = str(copy%3)+x
#         copy=copy//3
#     return x
#
# def d(n):
#     r = f(n)
#     if n%3 == 0:
#         r = r+r[-3:]
#     else:
#         r = r+f(n%3*3)
#     return int(r, 3)
#
# for n in range(1, 20):
#     if d(n) > 150:
#         print(n)
#         break


#===========================================
# КТ №16896479

# def f(n):
#     r = bin(n)[2:]
#     ost = n % 4
#     r = r + bin(ost)[2:]
#     return int(r, 2)
# cnt = 0
# for i in range(1100000000, 1987653210):
#     if f(i)
#         cnt += 1
# print(cnt)


def f(n):
    r = bin(n)[2:]
    oct = n % 3
    r = r + bin(oct)[2:]
    oct = n % 5
    r = r + bin(oct)[2:]
    return int(r, 2)

print(f(13))
